# 정렬sort
- 데이터 정렬
- 기준
    - 인덱스: sort_index
    - 값 : sort_values

In [1]:
import pandas as pd
import numpy as np

In [5]:
# 데이터 생성
df = pd.DataFrame({'value':[4, 35, 2, 66, 7], 'name': ['semi', 'non', 'nal', 'made', 'mix'],
 'age': [12, np.nan, 25, 14, np.nan]})
df

   value  name   age
0      4  semi  12.0
1     35   non   NaN
2      2   nal  25.0
3     66  made  14.0
4      7   mix   NaN

In [6]:
# 데이터 정보 확인
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   value   5 non-null      int64
 1   name    5 non-null      object
 2   age     3 non-null      float64
dtypes: float64(1), int64(1), object(1)
memory usage: 248.0+ bytes

In [7]:
# 인덱스 & 컬럼 확인
print(df.index, df.columns, sep= '\n')

RangeIndex(start=0, stop=5, step=1)
Index(['value', 'name', 'age'], dtype='object')

In [8]:
# 정렬하기
# [기본] 오름차순 -> ascending 파라미터 False -> 내림차순 정렬
df.sort_index(ascending=False)

   value  name   age
0      4  semi  12.0
1     35   non   NaN
2      2   nal  25.0
3     66  made  14.0
4      7   mix   NaN

In [10]:
# 특정 컬럼 기준 정렬 -> sort_values()
# name 컬럼으로 정렬
df.sort_values(by = 'name')

   value  name   age
3     66  made  14.0
4      7   mix   NaN
2      2   nal  25.0
1     35   non   NaN
0      4  semi  12.0

In [11]:
df.sort_values(by = 'name', ascending=False)

   value  name   age
0      4  semi  12.0
1     35   non   NaN
2      2   nal  25.0
4      7   mix   NaN
3     66  made  14.0

In [14]:
df.name[0], len(df.name[0])

('semi', 4)

In [18]:
some = [len(name) for name in df['name']]
df['length'] = some
df

   value  name   age  length
0      4  semi  12.0       4
1     35   non   NaN       3
2      2   nal  25.0       3
3     66  made  14.0       4
4      7   mix   NaN       3

In [19]:
df.sort_values(by= 'length')

   value  name   age  length
1     35   non   NaN       3
2      2   nal  25.0       3
4      7   mix   NaN       3
0      4  semi  12.0       4
3     66  made  14.0       4

In [63]:
a = lambda x: len(x)
df.sort_values(by='name', key=lambda col: col.str.len())

   value  name   age  length
1     35   non   NaN       3
2      2   nal  25.0       3
4      7   mix   NaN       3
0      4  semi  12.0       4
3     66  made  14.0       4

In [65]:
df['name'].str.casefold()

0    semi
1     non
2     nal
3    made
4     mix
Name: name, dtype: object

In [32]:
# 컬럼명 정렬
df.columns

Index(['value', 'name', 'age', 'length'], dtype='object')

In [37]:
colList = list(df.columns)
colList.sort()
colList

['age', 'length', 'name', 'value']

In [42]:
df2 = df[colList]
df2

    age  length  name  value
0  12.0       4  semi      4
1   NaN       3   non     35
2  25.0       3   nal      2
3  14.0       4  made     66
4   NaN       3   mix      7

In [56]:
df.dtypes

value       int64
name       object
age       float64
length      int64
dtype: object